{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "batch_input_shape": [null, 48, 48, 3], "input_dtype": "float32", "trainable": true, "name": "zeropadding2d_1"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_1", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_2"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_2", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_3"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_3", "nb_filter": 128, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_4"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_4", "nb_filter": 128, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_5"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_5", "nb_filter": 256, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_6"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_6", "nb_filter": 256, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_7"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_7", "nb_filter": 256, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_8"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_8", "nb_filter": 512, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_9"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_9", "nb_filter": 512, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_10"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_10", "nb_filter": 512, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_4", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_11"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_11", "nb_filter": 512, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_12"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_12", "nb_filter": 512, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_13"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_13", "nb_filter": 512, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_5", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 4096, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_1", "bias": true, "W_regularizer": null, "input_dim": 512, "W_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 2048, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_2", "bias": true, "W_regularizer": null, "input_dim": 4096, "W_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 2, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_3", "bias": true, "W_regularizer": null, "input_dim": 2048, "W_constraint": null, "activation": "softmax"}}]}